<a href="https://colab.research.google.com/github/mmasld/bmt_python/blob/main/21419_10%EC%A3%BC%EC%B0%A8%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [11]:
row = pd.date_range('20210507', periods=6)
col = list('ABCD')
df = pd.DataFrame(np.random.randn(6, 4), index=row, columns=col)

In [13]:
df

                   A         B         C         D
2021-05-07  3.432290  0.466636  0.090561 -1.702978
2021-05-08 -1.801433 -1.018796  0.064345 -0.862749
2021-05-09  0.312180 -0.184626 -1.298651  1.215560
2021-05-10 -1.093073  0.442463 -1.079236 -0.718771
2021-05-11  0.297129  0.159458 -1.211679 -0.631788
2021-05-12  0.931220  0.116377 -0.177630  0.290274

In [14]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20210507', periods=6))

In [15]:
df['F'] = s1

In [16]:
df

                   A         B         C         D  F
2021-05-07  3.432290  0.466636  0.090561 -1.702978  1
2021-05-08 -1.801433 -1.018796  0.064345 -0.862749  2
2021-05-09  0.312180 -0.184626 -1.298651  1.215560  3
2021-05-10 -1.093073  0.442463 -1.079236 -0.718771  4
2021-05-11  0.297129  0.159458 -1.211679 -0.631788  5
2021-05-12  0.931220  0.116377 -0.177630  0.290274  6

In [17]:
df>0

                A      B      C      D     F
2021-05-07   True   True   True  False  True
2021-05-08  False  False   True  False  True
2021-05-09   True  False  False   True  True
2021-05-10  False   True  False  False  True
2021-05-11   True   True  False  False  True
2021-05-12   True   True  False   True  True

In [18]:
df[df>0]

                   A         B         C         D  F
2021-05-07  3.432290  0.466636  0.090561       NaN  1
2021-05-08       NaN       NaN  0.064345       NaN  2
2021-05-09  0.312180       NaN       NaN  1.215560  3
2021-05-10       NaN  0.442463       NaN       NaN  4
2021-05-11  0.297129  0.159458       NaN       NaN  5
2021-05-12  0.931220  0.116377       NaN  0.290274  6

In [19]:
df2=df.copy()

In [42]:
df2[df2>0]

                   A         B         C         D  F
2021-05-07  3.432290  0.466636  0.090561       NaN  1
2021-05-08       NaN       NaN  0.064345       NaN  2
2021-05-09  0.312180       NaN       NaN  1.215560  3
2021-05-10       NaN  0.442463       NaN       NaN  4
2021-05-11  0.297129  0.159458       NaN       NaN  5
2021-05-12  0.931220  0.116377       NaN  0.290274  6

In [43]:
df2[df2>0] = -df

In [44]:
df2

                   A         B         C         D  F
2021-05-07  3.432290  0.466636  0.090561 -1.702978  1
2021-05-08 -1.801433 -1.018796  0.064345 -0.862749  2
2021-05-09  0.312180 -0.184626 -1.298651  1.215560  3
2021-05-10 -1.093073  0.442463 -1.079236 -0.718771  4
2021-05-11  0.297129  0.159458 -1.211679 -0.631788  5
2021-05-12  0.931220  0.116377 -0.177630  0.290274  6

In [45]:
df.mean(0)

A   -1.311221
B   -0.398059
C   -0.653684
D   -0.903687
F   -3.500000
dtype: float64

In [46]:
df.mean(1)

2021-05-07   -1.338493
2021-05-08   -1.149465
2021-05-09   -1.202203
2021-05-10   -1.466709
2021-05-11   -1.460011
2021-05-12   -1.503100
Freq: D, dtype: float64

In [47]:
print(df.apply(np.cumsum));print() # 데이터에 함수를 적용
# np.cumsum : 배열에서 주어진 축에 따라 누적되는 원소들의 누적 합을 계산하는 함수

print(df.apply(lambda x: x.max() - x.min())) # 행에 대해 함수 적용

                   A         B         C         D   F
2021-05-07 -3.432290 -0.466636 -0.090561 -1.702978  -1
2021-05-08 -5.233723 -1.485432 -0.154906 -2.565726  -3
2021-05-09 -5.545904 -1.670057 -1.453557 -3.781287  -6
2021-05-10 -6.638977 -2.112521 -2.532793 -4.500058 -10
2021-05-11 -6.936106 -2.271979 -3.744472 -5.131847 -15
2021-05-12 -7.867327 -2.388356 -3.922102 -5.422120 -21

A    3.135161
B    0.902419
C    1.234305
D    1.412704
F    5.000000
dtype: float64

In [54]:
df.apply(np.cumsum)

                   A         B         C         D   F
2021-05-07 -3.432290 -0.466636 -0.090561 -1.702978  -1
2021-05-08 -5.233723 -1.485432 -0.154906 -2.565726  -3
2021-05-09 -5.545904 -1.670057 -1.453557 -3.781287  -6
2021-05-10 -6.638977 -2.112521 -2.532793 -4.500058 -10
2021-05-11 -6.936106 -2.271979 -3.744472 -5.131847 -15
2021-05-12 -7.867327 -2.388356 -3.922102 -5.422120 -21

In [49]:
df

                   A         B         C         D  F
2021-05-07 -3.432290 -0.466636 -0.090561 -1.702978 -1
2021-05-08 -1.801433 -1.018796 -0.064345 -0.862749 -2
2021-05-09 -0.312180 -0.184626 -1.298651 -1.215560 -3
2021-05-10 -1.093073 -0.442463 -1.079236 -0.718771 -4
2021-05-11 -0.297129 -0.159458 -1.211679 -0.631788 -5
2021-05-12 -0.931220 -0.116377 -0.177630 -0.290274 -6

In [53]:
df.apply(np.cumsum, axis=1)

                   A         B         C         D         F
2021-05-07 -3.432290 -3.898926 -3.989487 -5.692465 -6.692465
2021-05-08 -1.801433 -2.820229 -2.884574 -3.747323 -5.747323
2021-05-09 -0.312180 -0.496806 -1.795457 -3.011017 -6.011017
2021-05-10 -1.093073 -1.535536 -2.614773 -3.333544 -7.333544
2021-05-11 -0.297129 -0.456588 -1.668267 -2.300055 -7.300055
2021-05-12 -0.931220 -1.047597 -1.225227 -1.515501 -7.515501

In [51]:
df

                   A         B         C         D  F
2021-05-07 -3.432290 -0.466636 -0.090561 -1.702978 -1
2021-05-08 -1.801433 -1.018796 -0.064345 -0.862749 -2
2021-05-09 -0.312180 -0.184626 -1.298651 -1.215560 -3
2021-05-10 -1.093073 -0.442463 -1.079236 -0.718771 -4
2021-05-11 -0.297129 -0.159458 -1.211679 -0.631788 -5
2021-05-12 -0.931220 -0.116377 -0.177630 -0.290274 -6

In [52]:
lambda x : x.max() - x.min()

In [57]:
df.apply(lambda x: x.max() - x.min(), axis = 1)

2021-05-07    3.341729
2021-05-08    1.935655
2021-05-09    2.815374
2021-05-10    3.557537
2021-05-11    4.840542
2021-05-12    5.883623
Freq: D, dtype: float64

In [56]:
df.A.max(), df.A.min()

(-0.2971291248494529, -3.432290415783151)

In [58]:
df

                   A         B         C         D  F
2021-05-07 -3.432290 -0.466636 -0.090561 -1.702978 -1
2021-05-08 -1.801433 -1.018796 -0.064345 -0.862749 -2
2021-05-09 -0.312180 -0.184626 -1.298651 -1.215560 -3
2021-05-10 -1.093073 -0.442463 -1.079236 -0.718771 -4
2021-05-11 -0.297129 -0.159458 -1.211679 -0.631788 -5
2021-05-12 -0.931220 -0.116377 -0.177630 -0.290274 -6

In [7]:
s = pd.Series(np.random.randint(1, 7, size = 60))

s.value_counts()

6    13
5    10
4    10
3    10
1    10
2     7
dtype: int64

In [9]:
df = pd.DataFrame(np.random.randn(10, 4))

In [11]:
df

          0         1         2         3
0  0.493385  0.685873  0.211345 -1.947939
1  1.139599  0.657158  1.041730  0.271556
2  0.086250  0.553465  0.405751 -1.564413
3 -0.922834  0.492727  1.132419  0.111008
4  0.340575 -0.373465  0.455511  1.509113
5  0.391743  0.087274 -1.630224 -1.222107
6  0.471541 -1.410786 -1.124201  0.497694
7 -1.594484 -2.499095  0.122588 -1.132087
8 -0.518521 -0.549530 -0.090756  0.870173
9 -1.474588  0.259371  0.380724  1.863866

In [15]:
 pieces = [df[:3], df[3:7], df[7:]]

In [16]:
pd.concat(pieces)

          0         1         2         3
0  0.493385  0.685873  0.211345 -1.947939
1  1.139599  0.657158  1.041730  0.271556
2  0.086250  0.553465  0.405751 -1.564413
3 -0.922834  0.492727  1.132419  0.111008
4  0.340575 -0.373465  0.455511  1.509113
5  0.391743  0.087274 -1.630224 -1.222107
6  0.471541 -1.410786 -1.124201  0.497694
7 -1.594484 -2.499095  0.122588 -1.132087
8 -0.518521 -0.549530 -0.090756  0.870173
9 -1.474588  0.259371  0.380724  1.863866

In [17]:
pieces

[          0         1         2         3
 0  0.493385  0.685873  0.211345 -1.947939
 1  1.139599  0.657158  1.041730  0.271556
 2  0.086250  0.553465  0.405751 -1.564413,
           0         1         2         3
 3 -0.922834  0.492727  1.132419  0.111008
 4  0.340575 -0.373465  0.455511  1.509113
 5  0.391743  0.087274 -1.630224 -1.222107
 6  0.471541 -1.410786 -1.124201  0.497694,
           0         1         2         3
 7 -1.594484 -2.499095  0.122588 -1.132087
 8 -0.518521 -0.549530 -0.090756  0.870173
 9 -1.474588  0.259371  0.380724  1.863866]

In [27]:
left = pd.DataFrame(
    {
      'a':['foo', 'foo'],
      'lval': [1, 2]
    }
)
right = pd.DataFrame({'a':['foo', 'foo'], 'rval': [4, 5]})

In [23]:
left

   key  lval
0  foo     1
1  foo     2

In [24]:
right

   key  rval
0  foo     4
1  foo     5

In [25]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [28]:
pd.merge(left, right, on = 'a')

     a  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [29]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    }
)

In [30]:
df

     A      B         C         D
0  foo    one  0.758712  1.323947
1  bar    one -0.216979  0.162479
2  foo    two -1.109151 -0.060619
3  bar  three -0.705232  0.278696
4  foo    two  0.124785  1.159594
5  bar    two -0.674499 -3.830358
6  foo    one -0.682600 -0.360627
7  bar  three  0.387590  1.147198

In [41]:
a = df.groupby('B').sum()

In [42]:
a

              C         D
B
one   -0.140867  1.125800
three -0.317642  1.425894
two   -1.658865 -2.731383

In [43]:
x = [1, 2, 3]
y = [4, 5, 6]
zipped = zip(x, y)
list(zipped)

[(1, 4), (2, 5), (3, 6)]

In [44]:
x2, y2 = zip(*zip(x, y))

In [45]:
x2

(1, 2, 3)

In [46]:
y2

(4, 5, 6)

In [50]:
a = df.groupby(['A', 'B'])

In [49]:
df = pd.DataFrame(
    {
        'A' : ['one', 'one', 'two', 'three'] * 3,
        'B' : ['A', 'B', 'C'] * 4,
        'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar' ] * 2,
        'D' : np.random.randn(12),
        'E' : np.random.randn(12)
    }
)

In [51]:
df

        A  B    C         D         E
0     one  A  foo  0.587860  0.160102
1     one  B  foo  1.242063  2.145190
2     two  C  foo -0.795035 -0.266042
3   three  A  bar  0.875732 -0.836875
4     one  B  bar -0.178436 -0.898390
5     one  C  bar -0.016458  1.251496
6     two  A  foo  0.208974  0.980392
7   three  B  foo  0.033186  1.138080
8     one  C  foo  0.244888  1.128509
9     one  A  bar  0.454113 -0.401938
10    two  B  bar -1.419691 -0.018474
11  three  C  bar -0.547864 -2.323994

In [52]:
pd.pivot_table(df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A  0.454113  0.587860
      B -0.178436  1.242063
      C -0.016458  0.244888
three A  0.875732       NaN
      B       NaN  0.033186
      C -0.547864       NaN
two   A       NaN  0.208974
      B -1.419691       NaN
      C       NaN -0.795035